---
kind: method
id: M:Autodesk.Revit.DB.ElementId.#ctor(System.Int32)
source: html/3acc195c-36fa-4ec9-78e0-370a12fddda5.htm
---
# Autodesk.Revit.DB.ElementId.#ctor Method

Create an ElementId handle with the given 32-bit integer id.

## Syntax (C#)
```csharp
[ObsoleteAttribute("This constructor is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the ElementId(Int64 id) constructor instead.")]
public ElementId(
	int id
)
```

## Parameters
- **id** (`System.Int32`) - The id.